УНФ_ТЕСТ/src/Catalogs/Банки/Банки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Банки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КоррСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеИзменение</name>
    <comment>0 - ложь (соответствует классификатору); 1 - истина (соответствует классификатору, ручные правки); 2 - неопределено (введен самостоятельно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СВИФТБИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/Банки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	
КонецПроцедуры // ПриКопировании()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Страна = Справочники.СтраныМира.Россия Тогда
	
		Если НЕ ЭтоГруппа Тогда
	
			Если ЗначениеЗаполнено(КоррСчет) И СтрДлина(СокрЛП(КоррСчет)) <> 20 Тогда
				ТекстСообщения = НСтр("ru = 'Корр.счет банка должен иметь 20 знаков.'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"КоррСчет",
					Отказ
				);			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КоррСчет) И НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда
				ТекстСообщения = НСтр("ru = 'В составе Корр.счета банка должны быть только цифры.'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"КоррСчет",
					Отказ
				);
			КонецЕсли;
			
			Если СтрДлина(СокрЛП(Код)) <> 9 Тогда
				ТекстСообщения = НСтр("ru = 'БИК банка должен иметь 9 знаков.'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"Код",
					Отказ
				);
			КонецЕсли;

			Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда
				ТекстСообщения = НСтр("ru = 'В составе БИК банка должны быть только цифры.'");
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					,
					,
					"Код",
					Отказ
				);
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Код");
		
	КонецЕсли;
	
	ТекстСообщения = "";
	Если Не SWIFTКорректен(СокрЛП(СВИФТБИК), ТекстСообщения) Тогда
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			"СВИФТБИК",
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет корректность номера SWIFT банка
//
// Параметры:
//  СВИФТБИК          - Строка - номер SWIFT  проверяемого банка
//  ТекстСообщения - Строка - в параметр передается текст сообщения об ошибке, если проверка не пройдена.
// 
// Возвращаемое значение:
//  Булево - Результат проверки SWIFT, если Ложь, тогда SWIFT некорректный
//
Функция SWIFTКорректен(СВИФТБИК, ТекстСообщения)
	
	Если ПустаяСтрока(СВИФТБИК) Тогда
		Возврат Истина;
	КонецЕсли;
	
	SWIFTКорректен = Ложь;
	ТекстСообщения = "";
	Если Не УправлениеНебольшойФирмойКлиентСервер.ПроверитьДлинуSWIFT(СВИФТБИК) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'SWIFT должен состоять из 8 или 11 символов'");
	ИначеЕсли Не УправлениеНебольшойФирмойКлиентСервер.ПроверитьРазрешенныеСимволыSWIFT(СВИФТБИК) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Разрешены только буквы от A до Z и цифры'");
	Иначе
		SWIFTКорректен = Истина;
	КонецЕсли;
	
	Возврат SWIFTКорректен;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
